Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: གསེར་གྱི་ར་བ་རིམ་པ་བདུན་གྱིས་ཡོངས་སུ་བསྐོར་བ་སྟེ། ར་བ་དེ་རྣམས་ཀྱི་འཕང་དུ་ནི་དཔག་ཚད་ཕྱེད་དང་གསུམ་ཡོད་དོ།
en: It is surrounded by seven golden walls, and each wall is three and a half yojanas high.

source: །ར་བ་དེ་རྣམས་ལ་ཅོག་རྣམ་པ་བཞི་པོ་གསེར་ལས་བྱས་པ་དང་། དངུལ་ལས་བྱས་པ་དང་། བཻ་ཌཱུརྱ་ལས་བྱས་པ་དང་། ཤེལ་ལས་བྱས་པ་དག་བཏགས་སོ།
en: On each wall, there are four towers made of gold, silver, lapis lazuli, and crystal.

source: །སྐར་ཁུང་ཁ་ཡར་ལྟ་བ་དང་། མར་ལྟ་བ་དག་ཀྱང་བཏོད་དོ།
en: The walls are also provided with upward-facing and downward-facing windows.

source: །གྲོང་ཁྱེར་བལྟ་ན་སྡུག་གི་ནང་གི་སའི་ཕྱོགས་ནི་བཟང་པོ། མཛེས་པ། བལྟ་ན་སྡུག་པ། བཀྲ་བ་ཤིན་ཏུ་བཀྲ་བ།
en: The ground in the city of Sudarśana is excellent, beautiful, pleasant to behold, variegated—exceptionally variegated, and colored in a hundred and one hues.

source: ཚོན་བརྒྱ་རྩ་གཅིག་གིས་བཀྲ་བར་བྱས་པ་དཔེར་ན་རས་བལ་གྱི་འདའ་བའམ་ཤིང་བལ་གྱི་འདའ་བ་ལྟ་བུར་འཇམ་པ། ཤིན་དུ་འཇམ་པ།
en: It is soft, exceptionally soft like tūla cotton or karpāsa cotton:

source: རྐང་པས་མནན་ནེམས་ཞེས་བྱེད་ལ། རྐང་པ་བཏེག་ན་བར་ཞེས་བྱེད་པ།
en: it yields when one steps on it, and rises when one raises one’s foot.

source: ལྷའི་མེ་ཏོག་མན་དཱ་རའི་ཕུང་པོ་པུས་མོ་ནུབ་ཙམ་བཀྲམ་པ་སྟེ།
en: Divine mandārava flowers cover the ground to such a height that one sinks in them to the knees.

source: རླུང་ལངས་པས་མེ་ཏོག་རྙིང་པ་རྣམས་ཁྱེར་ལ་མེ་ཏོག་སར་པ་རྣམས་འབབ་པར་བྱེད་དོ།
en: When the wind rises, it clears the old flowers away and causes new flowers to fall.

source: །བལྟ་ན་སྡུག་གི་གྲོང་ཁྱེར་ལ་སྒོ་དགུ་བརྒྱ་དགུ་བཅུ་རྩ་དགུ་ཡོད་དེ། སྒོ་རེ་རེ་ན་གནོད་སྦྱིན་གོས་སྔོན་པོ་ཅན་གོ་ཆ་བགོས་པ། མདའ་གཞུ་སྐྱེས་སྐོར་ཐོགས་པ་ལྔ་བརྒྱ་འདི་ལྟར་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་བསྲུང་བ་དང་། བསྐྱབ་པ་དང་། མཛེས་པར་བྱ་བའི་ཕྱིར་གནས་སོ།
en: There are nine hundred ninety-nine gates in the city of Sudarśana, and at each gate there are five hundred yakṣas in blue garments and armor, holding bows and arrows, and thus they protect, guard, and adorn the Thirty-Three Gods.

source: །གྲོང་ཁྱེར་བལྟ་ན་སྡུག་གི་སྲང་གི་སྲིད་དུ་ནི་དཔག་ཚད་ཉིས་སྟོང་ལྔ་བརྒྱ་ཡོད་ལ་རྒྱར་ནི་དཔག་ཚད་བཅུ་གཉིས་ཡོད་དེ་བཟང་པོ་མཛེས་པ།
en: “The streets in the city of Sudarśana are two thousand five hundred yojanas long and twelve yojanas wide.

source: བལྟ་ན་སྡུག་པ། གསེར་གྱི་བྱེ་མས་བདལ་བ། ཙན་དན་གྱི་ཆུས་ཆག་ཆག་བཏབ་པ། གསེར་གྱི་དྲ་བས་བྲེས་པ།
en: They are excellent, beautiful and pleasant to behold, spread with golden sand, sprinkled with sandalwood water, and covered with golden lattices.

source: དེའི་ཕྱོགས་ཀུན་ན་རྫིང་བུ་རྣམ་པ་སྣ་ཚོགས་ཡོད་དེ།
en: There are various ponds throughout the city.

source: རྫིང་བུ་དེ་རྣམས་ཕ་གུ་རྣམ་པ་བཞི་པོ་གསེར་ལས་བྱས་པ་དང་། དངུལ་ལས་བྱས་པ་དང་། བཻ་ཌཱུརྱ་ལས་བྱས་པ་དང་། ཤེལ་ལས་བྱས་པས་བསྐོར་ཏོ། །རྫིང་བུ་དེ་རྣམས་ཀྱི་ཐེམ་སྐས་རྣམ་པ་བཞི་པོ་གསེར་ལས་བྱས་པ་དང་། དངུལ་ལས་བྱས་པ་དང་། བཻ་ཌཱུརྱ་ལས་བྱས་པ་དང་། ཤེལ་ལས་བྱས་པ་ཡིན་ནོ།
en: These ponds are surrounded by four kinds of bricks made of gold, silver, lapis lazuli, and crystal.

source: །རྫིང་བུ་དེ་རྣམས་ལན་ཀན་རྣམ་པ་བཞི་པོ་གསེར་ལས་བྱས་པ་དང་། དངུལ་ལས་བྱས་པ་དང་། བཻ་ཌཱུརྱ་ལས་བྱས་པ་དང་། ཤེལ་ལས་བྱས་པས་བསྐོར་ཅིང་།
en: The ponds are also provided with stairs made of gold, silver, lapis lazuli, and crystal, and the ponds are surrounded by parapets made of gold, silver, lapis lazuli, and crystal.

source: གསེར་ལས་བྱས་པའི་ལན་ཀན་གྱི་གཟུངས་གཟེར་དང་། གདང་བུ་དང་། ལན་ཀན་གྱི་རྟེན་མ་དངུལ་ལས་བྱས་པ་དང་། དངུལ་ལས་བྱས་པའི་ལན་ཀན་གྱི་གཟུངས་གཟེར་དང་། གདང་བུ་དང་། ལན་ཀན་གྱི་རྟེན་མ་གསེར་ལས་བྱས་པ་དང་། བཻ་ཌཱུརྱ་ལས་བྱས་པའི་ལན་ཀན་གྱི་གཟུངས་གཟེར་དང་། གདང་བུ་དང་། ལན་ཀན་གྱི་རྟེན་མ་ཤེལ་ལས་བྱས་པ་དང་། ཤེལ་ལས་བྱས་པའི་ལན་ཀན་གྱི་གཟུངས་གཟེར་དང་། གདང་བུ་དང་། ལན་ཀན་གྱི་རྟེན་མ་བཻ་ཌཱུརྱ་ལས་བྱས་པ་ཡིན་ནོ།
en: The nails, rails, and bases of the gold parapets are made of silver; those of the silver parapets are made of gold; those of the lapis lazuli parapets are made of crystal; and those of the crystal parapets are made of lapis lazuli.

source: །རྫིང་བུ་དེ་རྣམས་ཆུ་སྦྲང་རྩི་ལྟར་མངར་ཞིང་བསིལ་བས་གང་ལ། ཨུཏྤ་ལ་དང་། པད་མ་དང་། ཀུ་མུ་ད་དང་། པད་མ་དཀར་པོས་གང་ཞིང་ཆུ་ལ་གནས་པའི་བྱ་རྣམ་པ་སྣ་ཚོགས་འདོད་དགུར་སྒྱུར་བའི་གཟུགས་ཅན་རྣམས་ཀྱིས་སྙན་ཅིང་འཇེབས་ལ་ཡིད་དུ་འོང་བའི་སྒྲ་སྐད་འབྱིན་པར་བྱེད་དོ།
en: “These ponds are filled with water that is honey-sweet and cool, covered with utpala, padma, kumuda, and puṇḍarīka flowers. There, various aquatic birds that assume any shape at will sing in melodious, beautiful, and pleasing voices.

source: །དེའི་ཕྱོགས་ཀུན་ན་མེ་ཏོག་གི་ཤིང་དང་། འབྲས་བུའི་ཤིང་དང་། དབུ་རྒྱན་སྐྱེ་བ་དག་ཤིན་དུ་དབྱིབས་ལེགས་ཤིང་ལེགས་པར་སྐྱེས་པ་ནི་དཔེར་ན་ཕྲེང་བ་མཁན་ནམ་ཕྲེང་བ་མཁན་གྱི་སློབ་མ་མཁས་པ་ཞིག་གིས་རྣ་རྒྱན་དུ་བྱ་བའི་ཕྱིར་མེ་ཏོག་གི་ཕྲེང་བ་ལེགས་པར་བརྒྱུས་པ་བཞིན་ནོ།
en: Everywhere around these ponds, trees bearing blossoms, trees bearing fruits, and trees bearing diadems grow in a very lovely manner, just like garlands skillfully made as earrings by a skilled garland maker or pupil of a garland maker.

source: །ཐང་ལ་གནས་པའི་བྱ་རྣམ་པ་སྣ་ཚོགས་འདོད་དགུར་སྒྱུར་བའི་གཟུགས་ཅན་རྣམས་ཀྱང་སྙན་ཅིང་འཇེབས་པའི་སྒྲ་སྐད་འབྱིན་ཏོ།
en: Various terrestrial birds that assume any shape at will sing in melodious and beautiful voices, too.

source: །གྲོང་ཁྱེར་བལྟ་ན་སྡུག་ན་དཔག་བསམ་གྱི་གོས་ཀྱི་ཤིང་ལྗོན་པ་རྣམ་པ་བཞི་པོ་སྔོན་པོ་དང་། སེར་པོ་དང་དམར་པོ་དང་། དཀར་པོ་རྣམས་ལས་དཔག་བསམ་གྱི་ཤིང་ལྗོན་པ་ལས་བྱུང་བའི་གོས་རྣམ་པ་བཞི་པོ་སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་རྣམས་ཏེ།
en: “In the city of Sudarśana, wish-fulfilling trees of four kinds of cloth, namely, blue, yellow, red, and white, produce four kinds of clothes of these colors, respectively.

source: ལྷའམ་ལྷའི་བུ་མོ་དག་ཇི་ལྟ་བུ་འདོད་པ་སེམས་བསྐྱེད་མ་ཐག་ཏུ་དེ་ལྟ་བུ་ལག་ཏུ་འཐོབ་པར་འགྱུར་རོ།
en: Gods and goddesses obtain at once exactly what they want from these trees.

source: །རྒྱན་གྱི་ཤིང་རྣམ་པ་བཞི་པོ་རྣམས་ལས་རྒྱན་རྣམ་པ་བཞི་པོ་ལག་པའི་རྒྱན་དང་། རྐང་པའི་རྒྱན་དང་། སྨད་ཀྱི་རྒྱན་དང་། སྣང་བར་བྱ་བའི་རྒྱན་ནོ།
en: “Four kinds of ornament trees produce four kinds of ornaments, namely, ornaments for the arms, ornaments for the ankles, ornaments to be worn under garments, and ornaments for display.

source: །ལྷའི་བུའམ་ལྷའི་བུ་མོ་དག་ཇི་ལྟ་བུ་འདོད་པའི་སེམས་བསྐྱེད་མ་ཐག་ཏུ་དེ་ལྟ་བུ་ལག་ཏུ་འཐོབ་པར་འགྱུར་རོ།
en: Gods and goddesses obtain at once exactly what they want from these trees.

source: །རོལ་མོའི་ཆ་སྤྱད་རྣམ་པ་བཞི་པོ་པི་བང་དང་། གླིང་བུ་དང་། པི་བང་རྒྱུད་གསུམ་པ་དང་། སྒྲ་སྙན་རྣམས་ལས་ལྷའམ་ལྷའི་བུ་མོས་ཇི་ལྟ་བུ་འདོད་པ་སེམས་བསྐྱེད་མ་ཐག་ཏུ་དེ་ལྟ་བུ་ལག་ཏུ་འཐོབ་པར་འགྱུར་རོ།
en: “Gods and goddesses may also obtain at once exactly what they want when they want any of the four kinds of musical instruments, namely, lutes, flutes, three-stringed lutes, and harps.

source: །ལྷའི་ཁ་ཟས་རྣམ་པ་བཞི་པོ་སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་རྣམས་ལས་ལྷའམ་ལྷའི་བུ་མོས་ཇི་ལྟ་བུ་འདོད་པ་སེམས་བསྐྱེད་མ་ཐག་ཏུ་དེ་ལྟ་བུ་ལག་ཏུ་འཐོབ་པར་འགྱུར་རོ།
en: “Gods and goddesses may also obtain at once exactly what they want, when they want any of the four kinds of divine foods, namely, blue, yellow, red, and white.

source: །ཁང་པ་དང་། ཁང་པ་རྩེག་མ་དང་། བསིལ་ཁང་དང་། ཁྱམས་དང་། སྐར་ཁུང་དང་། མཐོངས་ཁུང་ཅན་བུད་མེད་ཀྱི་ཚོགས་རྣམས་དང་། ལྷ་མོའི་ཚོགས་རྣམས་འདུ་བའི་གནས་དག་ཡོད་དེ།
en: “There are houses with balconies, cool rooms, terraces, windows, and skylights, places where groups of women or groups of celestial nymphs gather.

source: དེ་ན་བཏུང་བ་སྦྲང་རྩིའི་བཏུང་བ་དང་། མ་དྷ་བའི་བཏུང་བ་དང་། ཀ་དམ་བྷ་རའི་བཏུང་བ་དང་། རོལ་མོའི་སྒྲ་སྐད་རྣམས་ཀྱིས་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་རྩེ་བར་བྱེད། དགའ་བར་བྱེད། དགའ་མགུར་སྤྱོད་པར་བྱེད་དེ།
en: There the Thirty-Three Gods play, amuse themselves, and enjoy themselves with drinks of honey, liquor produced from honey, and liquor from kadamba blossoms, as well as various sounds of music.

source: རང་གི་བསོད་ནམས་ཀྱི་འབྲས་བུ་ཉམས་སུ་མྱོང་བར་བྱེད་དོ། །སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱི་ལྷའི་འདུན་ས་ཆོས་བཟང་ཞེས་བྱ་བ་སྲིད་དུ་དཔག་ཚད་སུམ་བརྒྱ།
en: Thus they enjoy the fruit of their own merit.

source: རྒྱར་དཔག་ཚད་སུམ་བརྒྱ་སྟེ། ཁོ་ར་ཁོར་ཡུག་ཏུ་དཔག་ཚད་དགུ་བརྒྱ་ཡོད་པ། བཟང་པོ། མཛེས་པ། བལྟ་ན་སྡུག་པ། ཤེལ་གྱི་རྒྱུ་ལས་བྱུང་བ་སྟེ། གྲོང་ཁྱེར་དེ་ལས་དཔག་ཚད་ཕྱེད་དང་བཞི་གྱེན་དུ་འཕགས་སོ།
en: “The Thirty-Three Gods’ divine meeting hall, Sudharmā, is three hundred yojanas in length and width, and nine hundred yojanas in circumference. It is excellent, beautiful, and pleasant to behold, made of crystal, and located four and a half yojanas above the city.

source: །དེར་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱི་སྟན་བཤམས་པ་ནི་ཉེ་དབང་པོ་སུམ་བཅུ་རྩ་གཉིས་དང་། སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གྱི་སྟན་དག་སོ་སོར་བཤམས་སོ།
en: There the Thirty-Three Gods’ seats are arranged: namely, the seats of the thirty-two brothers of Indra and the seat of Śakra, Lord of the Thirty-Three Gods.

source: །རྒྱལ་པོ་ང་ལས་ནུའི་སྟན་ནི་སྟན་དེ་དག་ཐམས་ཅད་ཀྱི་མཇུག་ཁོ་ནར་བཤམས་སོ།
en: King Māndhātṛ’s seat was arranged at the very end of all these seats.

source: །དེ་ནས་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་མཆོད་ཡོན་ཐོགས་ཏེ་རྒྱལ་པོ་ང་ལས་ནུ་བསུའོ།
en: “The Thirty-Three Gods welcomed King Māndhātṛ with offerings.

source: །དེ་ན་སེམས་ཅན་བསོད་ནམས་ཀྱི་རྣམ་པར་སྨིན་པས་དབང་ཆེ་བར་གྲགས་པ་གང་ཡིན་པ་དེ་དག་ནི་རིམ་གྱིས་ནང་དུ་ཞུགས་སོ།
en: In due course, those beings who were known to have great power from the maturation of their own merits entered there;

source: །ལྷག་མ་རྣམས་ནི་ཕྱི་རོལ་ན་འཁོད་པ་དང་། རྒྱལ་པོ་ང་ལས་ནུས་བསམས་པ།
en: others sat down outside. “King Māndhātṛ

source: སྟན་བཤམས་པ་གང་དག་ཡིན་པ་འདི་རྣམས་ལས་སྟན་ཐ་མ་གང་ཡིན་པ་འདི་ནི་གདོན་མི་ཟ་བར་བདག་གི་སྟན་ཡིན་ནོ་སྙམ་ནས།
en: thought, ‘Certainly the last one of these arranged seats is mine.’ Then King Māndhātṛ

source: དེ་ནས་རྒྱལ་པོ་ང་ལས་ནུ་འདི་སྙམ་དུ་ཀྱེ་མའོ་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་སྟན་ཕྱེད་བདག་ལ་བསྟབས་ཀྱང་ཅི་མ་རུང་སྙམ་དུ་བསམས་པ་དང་། སེམས་བསྐྱེད་མ་ཐག་ཏུ། རྒྱལ་པོ་ཆེན་པོ་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་རྒྱལ་པོ་ང་ལས་ནུ་ལ་སྟན་ཕྱེད་བསྟབས་ནས།
en: thought, ‘Oh, I wish Śakra, Lord of the Gods, would offer half of his seat to me.’ Great King, as soon as he thought this, Śakra, Lord of the Gods, did offer half of his seat to King Māndhātṛ, and King Māndhātṛ

source: རྒྱལ་པོ་ང་ལས་ནུ་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གྱི་སྟན་ཕྱེད་ལ་འདུག་གོ། །རྒྱལ་པོ་ཆེན་པོ་རྒྱལ་པོ་ང་ལས་ནུ་དང་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་སྟན་གཅིག་ལ་འདུག་པ་ན་འདི་ལྟ་སྟེ་སྲིད་དུའམ། ཞེང་དུའམ། ཁ་དོག་རྒྱས་པའམ།
en: sat down on half of the seat of Śakra, Lord of the Gods. “Great King, when King Māndhātṛ

source: སྨྲ་དངགས་ལ་ཁྱད་པར་རམ། བསམ་པའམ། ཐ་དད་དུ་བྱ་བ་ཅུང་ཟད་ཀྱང་མེད་དེ། གཞན་དུ་ན་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་ནི་མིག་མི་འཛུམས་སོ།
en: and Śakra, Lord of the Gods, sat on one seat together, there was no difference, no distinction, and no contrast between them in their height, girth, perfection of figure, or speaking, except that Śakra, Lord of the Gods, did not blink his eyes.

source: །རྒྱལ་པོ་ཆེན་པོ་རྒྱལ་པོ་ང་ལས་ནུ་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱི་ནང་ན་འདུག་པ་ལ་བརྒྱ་བྱིན་སུམ་བཅུ་རྩ་དྲུག་ཤི་འཕོས་པ་ལོན་ནོ།
en: “Great King, while King Māndhātṛ was sitting among the Thirty-Three Gods, thirty-six successive Śakras died.

source: །ཡང་དེ་ན་ལྷ་རྣམས་ལ་ལྷ་དང་ལྷ་མ་ཡིན་གཡུལ་འགྱེད་པ་འབྱུང་སྟེ།
en: “Thereupon a battle broke out there between the gods and the asuras.

source: དེ་ལ་གལ་ཏེ་ལྷ་མ་ཡིན་རྣམས་ཕམ་པར་གྱུར་ན་ནི་ལྷ་མ་ཡིན་དེ་རྣམས་གྲོང་ཁྱེར་གྱི་སྒོ་བཅད་ནས་ར་བའི་ཁ་བསྐོར་ནས་འདུག་གོ།
en: Whenever the asuras were defeated there, they closed the gate of their city and, after walking back and forth on the top of the wall, sat down;

source: །འོན་ཏེ་ལྷ་རྣམས་ཕམ་པར་གྱུར་ན་ནི་ལྷ་དེ་རྣམས་ཀྱང་ཁང་པའི་སྒོ་རྣམས་བཅད་ནས་ར་བའི་ཁ་བསྐོར་ནས་འདུག་གོ།
en: whenever the gods were defeated, they closed the gate of their city and, after walking back and forth on the top of the wall, sat down.

source: །ཇི་ཙམ་ན་ལྷ་མ་ཡིན་རྣམས་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པ་གོ་བསྐོན་ནས་གཅན་རིམ་པ་ལྔ་དྲལ་ཏེ་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གྱི་དྲུང་དུ་གཡུལ་འགྱེད་དུ་འོངས་པ་དང་། གནོད་སྦྱིན་རྣམས་ཀྱིས་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་ལ་སྨྲས་པ།
en: “Then the asuras prepared their army consisting of four divisions. Having broken through the five barriers, they advanced to attack Śakra, Lord of the Gods.

source: ཀཽ་ཤི་ཀ་མཁྱེན་པར་མཛོད་ཅིག །ལྷ་མ་ཡིན་རྣམས་ཀྱིས་གཅན་རིམ་པ་ལྔ་དྲལ་ཏེ་ཉེ་བར་མཆིས་ཀྱིས།
en: The yakṣas said to Śakra, Lord of the Gods, ‘Kauśika, please be informed that the asuras are approaching, having broken through the five barriers. Please get on with your business;

source: ཁྱོད་ཀྱི་བགྱི་བ་དང་བཤམས་པ་གང་ལགས་པ་དེ་མཛོད་ཅིག །དེ་ནས་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པ་གོ་བགོས་ནས་ལྷ་མ་ཡིན་དང་གཡུལ་སྤྲད་པའི་ཕྱིར་སྤགས་པ་རྒྱལ་པོ་ང་ལས་ནུས་མཐོང་ནས་སྨྲས་པ།
en: do what should be done.’ “Then Śakra, Lord of the Gods, prepared his army consisting of four divisions and made them march against the asuras. When he saw this, King Māndhātṛ said, ‘Please stay here;

source: བཞུགས་ཤིག་བདག་ཉིད་མཆིའོ།
en: I will go.’

source: །བརྒྱ་བྱིན་གྱིས་སྨྲས་པ།
en: “ ‘Please do so,’ replied Śakra.

source: དེ་བཞིན་མཛོད་ཅིག །དེ་ནས་རྒྱལ་པོ་ང་ལས་ནུ་དཔུང་གི་ཚོགས་བྱེ་བ་བརྒྱད་འབུམ་དང་སྟེང་གི་ནམ་མཁའ་ལ་འཕགས་ནས་གཞུ་རྒྱུད་ཀྱི་སྒྲ་སྦྲེངས་སོ།
en: “King Māndhātṛ then flew with an army of eight trillion up into the sky and sounded his bowstring.

source: །ལྷ་མ་ཡིན་རྣམས་ཀྱིས་དེ་ཐོས་ནས་སྨྲས་པ། འདི་སུའི་གཞུ་རྒྱུད་ཀྱི་སྒྲ་ཡིན། དེ་རྣམས་ཀྱིས་འདི་ནི་རྒྱལ་པོ་ང་ལས་ནུའི་གཞུ་རྒྱུད་ཀྱི་སྒྲ་ཡིན་ནོ་ཞེས་ཐོས་སོ། །ཐོས་ནས་ངོ་མཚར་སྐྱེས་པར་གྱུར་ཏོ།
en: When they heard this, the asuras asked each other, ‘Whose bowstring is sounding?’ They heard that this was the sound of King Māndhātṛ’s bowstring, and felt wonder at this.

source: །ཇི་ཙམ་ན་རྒྱལ་པོ་ང་ལས་ནུས་སྤགས་པ་དང་། ཆོས་ཉིད་ཀྱིས་ལྷ་རྣམས་དང་ལྷ་མ་ཡིན་དེ་རྣམས་གཡུལ་འགྱེད་པའི་ཤིང་རྟ་དག་ནམ་མཁའ་ལ་ཐད་ཀ་ཐད་ཀར་འདུག་སྟེ།
en: “Then King Māndhātṛ made his army proceed. It is natural that each chariot of fighting gods and asuras remains horizontally in the sky, not hovering above or below the others.

source: གང་གི་ཡང་མཐོན་དམན་མེད་པ་ཡིན་པ་ལས་རྒྱལ་པོ་ང་ལས་ནུའི་ནི་ལྷ་མ་ཡིན་ཐམས་ཅད་ཀྱི་ལྟག་གི་ནམ་མཁའ་ལ་འཕགས་ནས་འདུག་གོ།
en: But King Māndhātṛ’s chariot flew up into the sky above all the asuras and stayed there.

source: །ལྷ་མ་ཡིན་དེ་རྣམས་ཀྱིས་སྨྲས་པ། བདག་ཅག་གི་ལྟག་ན་ནམ་མཁའ་ལ་སྤགས་ཏེ་འདུག་པ་འདི་སུ་ཞིག་ཡིན།
en: The asuras asked each other, ‘Who flew up into the sky above us and remains there?’

source: དེ་རྣམས་ཀྱིས་འདི་ནི་མིའི་རྒྱལ་པོ་ང་ལས་ནུ་ཞེས་བྱ་བ་ཡིན་ནོ་ཞེས་ཐོས་སོ། །ཐོས་ནས་དེ་རྣམས་ཀྱིས་བསམས་པ། གང་གི་ཤིང་རྟ་བདག་ཅག་གི་ལྟག་ཏུ་ནམ་མཁའ་ལས་འགྲོ་བའི་སེམས་ཅན་འདི་ནི་བསོད་ནམས་ཀྱི་རྣམ་པར་སྨིན་པས་དབང་ཆེ་བར་གྲགས་པ་ཡིན་ནོ་སྙམ་ནས།
en: “When they heard that this was the human king, Māndhātṛ, they thought, ‘This being, whose chariot flies in the sky above us, is someone who is known to have great power from the maturation of his merits.’

source: དེ་རྣམས་ཕམ་པར་གྱུར་ཏེ་འཇིགས་སྐྲག་ཅིང་བཅོམ་པས་རྒྱབ་བསྟན་ནས་ལྷ་མ་ཡིན་རྣམས་ཀྱི་གནས་སུ་ཞུགས་སོ།
en: “They were then defeated. Frightened and outfought, they turned their backs and retreated to the residence of the asuras.

source: །རྒྱལ་པོ་ང་ལས་ནུས་སྨྲས་པ། གང་རྒྱལ།
en: “ ‘Who won?’ asked King Māndhātṛ.

source: བློན་པོ་རྣམས་ཀྱིས་སྨྲས་པ། ལྷ་རྒྱལ་ལགས་སོ།
en: “The ministers answered, ‘Your Majesty did.’

source: །རྒྱལ་པོས་བསམས་པ། སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་པས་ནི་བདག་ལྷག་གོ་སྙམ་མོ།
en: “ ‘I am superior to the Thirty-Three Gods,’ thought the king.

source: །དེ་ནས་རྒྱལ་པོ་ང་ལས་ནུ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: “Then King Māndhātṛ

source: བདག་ལ་འཛམ་བུའི་གླིང་འབྱོར་པ་དང་། རྒྱས་པ་དང་། བདེ་བ་དང་། ལོ་ལེགས་པ། སྐྱེ་བོ་དང་། མི་མང་པོས་རབ་ཏུ་གང་བ་ཡང་ཡོད།
en: thought, ‘I have the continent of Jambu, which is rich, prosperous, peaceful, abundant in food, and full of many people.

source: བདག་ལ་ཤར་གྱི་ལུས་འཕགས་དང་། ནུབ་ཀྱི་བ་ལང་སྤྱོད་དང་། བྱང་གི་སྒྲ་མི་སྙན་གྱི་གླིང་ཡང་ཡོད།
en: I have the continents of Videha in the east, Godānīya in the west, and Kuru in the north, too.

source: བདག་ལ་རིན་པོ་ཆེ་སྣ་བདུན་འདི་ལྟ་སྟེ། འཁོར་ལོ་རིན་པོ་ཆེ་དང་། གླང་པོ་རིན་པོ་ཆེ་དང་། རྟ་རིན་པོ་ཆེ་དང་། ནོར་བུ་རིན་པོ་ཆེ་དང་། བཙུན་མོ་རིན་པོ་ཆེ་དང་། ཁྱིམ་བདག་རིན་པོ་ཆེ་དང་། བདུན་པ་བློན་པོ་རིན་པོ་ཆེ་ཡང་ཡོད།
en: I also have seven treasures: namely, the precious chakra, elephant, horse, jewel, woman, householder, and minister.

source: བདག་ལ་བུ་དཔའ་བ། རྟུལ་ཕོད་པ། ཡན་ལག་མཆོག་གི་གཟུགས་དང་ལྡན་པ། ཕ་རོལ་གྱི་སྡེ་རབ་ཏུ་འཇོམས་པར་བྱེད་པ་སྟོང་ཡང་ཚང་བར་ཡོད།
en: Furthermore, I have a thousand sons who are brave, bold, and endowed with excellent physiques, and who will defeat the enemy’s army.

source: བདག་གི་ཕོ་བྲང་གི་ནང་དུ་ཡང་གསེར་གྱི་ཆར་ཞག་བདུན་དུ་བབ།
en: A rain of jewels fell in my palace for seven days.

source: བདག་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱི་ནང་དུ་ཡང་ཕྱིན། ལྷའི་འདུན་ས་ཆོས་བཟང་དུ་ཡང་ཞུགས། ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་ཀྱང་བདག་ལ་སྟན་ཕྱེད་བསྟབས་ཀྱིས་ཀྱེ་མའོ་བདག་གིས་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གནས་འདི་ནས་ཕྱུང་ལ།
en: I came to the Thirty-Three Gods, I entered the divine meeting hall, Sudharmā, and Śakra, Lord of the Gods, gave me half of his seat.

source: བདག་ཁོ་ནས་ལྷ་དང་མི་རྣམས་ཀྱི་རྒྱལ་སྲིད་ཀྱི་དབང་ཕྱུག་ལ་དབང་བྱའོ་སྙམ་པ་དང་། སེམས་བསྐྱེད་མ་ཐག་ཏུ་རྒྱལ་པོ་ཆེན་པོ་རྒྱལ་པོ་ང་ལས་ནུ་འབྱོར་པ་དེ་ལས་ཡོངས་སུ་ཉམས་ཏེ།
en: Thus, I will now drive away Śakra, Lord of the Gods, from this residence, and I myself will rule all the kingdoms of gods and humans.’ “As soon as he thought this, Great King, King Māndhātṛ’s success ended.

source: འཛམ་བུའི་གླིང་དུ་འོངས་ནས་ནད་ཚབས་པོ་ཆེ་ཞིག་གིས་ཐེབས་ཏེ་སྡུག་བསྔལ་མི་བཟད་པ་འཆི་བ་ལ་ཐུག་པ་མྱོང་བ་དང་། དེ་ནས་རྒྱལ་པོ་ང་ལས་ནུའི་བློན་པོ་དང་། རྩིས་པ་དང་། རྒྱལ་སྲིད་འབུལ་བའི་སྣ་ཆེན་པོ་ལ་གཏོགས་པ་དང་། གསང་སྔགས་ཀྱིས་ལྷན་ཅིག་འཚོ་བར་བྱེད་པ་རྣམས་རྒྱལ་པོ་ང་ལས་ནུ་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་། རྒྱལ་པོ་ང་ལས་ནུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: He alighted on the continent of Jambu, became seriously ill, and experienced unbearable mortal pain. “Thereupon King Māndhātṛ’s ministers, astrologers, chief ministers who had installed the king on the throne, and those who lived by mantras went to King Māndhātṛ.

source: །ལྷ་འདས་ནས་ཡུལ་འཁོར་གྱི་མི་སླད་མ་རྣམས་ཤེས་ལྡན་དག་རྒྱལ་པོ་ང་ལས་ནུས་ནོངས་པའི་དུས་ཀྱི་ཚེ་ཅི་ཞིག་གསུངས་ཞེས་འདྲི་ན།
en: When they arrived, they asked the king, ‘If, after Your Majesty passes away, the people in the kingdom left behind ask us, “Sirs, what did King Māndhātṛ

source: དེ་སྐད་དུ་འདྲི་བ་དེ་དག་ལ་བདག་ཅག་གིས་ཇི་སྐད་དུ་ལན་གདབ་པར་བགྱི།
en: say at his last moment?” how should we answer those people who ask this?’

source: སྣ་བོ་དག་ང་འདས་ནས་གལ་ཏེ་ཁྱེད་ཅག་ལ་སྐྱེ་བོ་ཕྱི་མ་རྣམས་ཉེ་བར་འོངས་ནས་དེ་སྐད་དུ་འདྲི་བར་བྱེད་ན། འདྲི་བ་དེ་དག་ལ་ཁྱེད་ཀྱིས་ལན་འདི་སྐད་ཅེས་ཐོབ་ཤིག །ཤེས་ལྡན་དག་རྒྱལ་པོ་ང་ལས་ནུ་ནི་རིན་པོ་ཆེ་སྣ་བདུན་དང་ཡང་ལྡན།
en: “ ‘Leaders, if, after my death, the people left behind come to you and ask you this, you should answer those people, “Sirs, King Māndhātṛ

source: མིའི་འབྱོར་པ་རྣམ་བཞིས་གླིང་བཞིར་རྒྱལ་སྲིད་ཀྱི་དབང་ཕྱུག་ལ་ཡང་དབང་བྱེད་དུ་བཅུག །སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱི་ནང་དུ་ཡང་སོང་ནས་འདོད་པའི་ཡོན་ཏན་རྣམ་པ་ལྔ་པོ་དག་གིས་མ་ངོམས་བཞིན་དུ་ནོངས་སོ་ཟེར་རོ་ཞེས་གྱིས་ཤིག །ཚིགས་སུ་བཅད་པ་དག་ཀྱང་སྨྲས་པ།
en: is said to have passed away not content with the five objects of desire, even after having possessed the seven treasures, ruled over his kingdom in the four continents with the four kinds of human success, and even gone to the Thirty-Three Gods.” ’ “Then he spoke some verses:

source: ཀཱར་ཥཱ་པ་ཎའི་ཆར་བབ་ཀྱང་།
en: “ ‘Even if a rain of kārṣāpaṇas falls,

source: །འདོད་པ་དག་ལ་ངོམས་པ་མེད།
en: One would not be content with the objects of one’s desire.

source: །མཁས་པས་འདོད་པ་མནོག་ཆུང་ཞིང་།
en: The wise, knowing that the objects of desire

source: །སྡུག་བསྔལ་མང་པོར་ཤེས་ནས་ནི།
en: Provide little pleasure and much pain,

source: །ལྷ་ཡི་འདོད་པ་རྣམས་ལ་ཡང་། །དགའ་བར་འགྱུར་བ་མེད་པ་ཉིད།
en: “ ‘Are not pleased Even with divine objects of desire.

source: །ཡང་དག་རྫོགས་པའི་སངས་རྒྱས་ཀྱི།
en: The disciples of the Perfectly Awakened One

source: །ཉན་ཐོས་སྲེད་པ་ཟད་ལ་དགའ།
en: Are pleased with the destruction of existence.

source: །གངས་ཀྱི་རི་དང་མཉམ་པ་ཡི། །གསེར་གྱི་རི་བོར་གྱུར་ཀྱང་ནི།
en: “ ‘Even a mountain of gold Equal to the Himalaya

source: །གཅིག་གི་ནོར་དུའང་དེས་མི་ཆོག །མཁས་པས་དེ་ལྟར་ཤེས་པར་བྱ།
en: Would not be sufficient to be one’s possession. Thus should be known by the wise.

source: །གང་ཞིག་གཞི་འདིས་སྡུག་བསྔལ་རྟོག་པ་དེ།
en: “ ‘How could one who thus understands suffering

source: །འདོད་པ་དག་ལ་གཞར་ཡང་ཇི་ལྟར་དགའ།
en: Be pleased with objects of desire?

source: །འཇིག་རྟེན་ནོར་དག་ཟུག་རྔུར་རྟོགས་ནས་ནི།
en: Knowing that worldly wealth is painful,

source: །བརྟན་པས་དེ་ཉིད་གདུལ་ཕྱིར་བསླབ་པར་བྱ།
en: One who is steady should learn to overcome it.’

source: །རྒྱལ་པོ་ཆེན་པོ་དེ་ལྟ་བས་ན་རྣམ་གྲངས་འདིས་ཁྱོད་ཀྱིས་འདི་ལྟར་གང་མིའི་འཇིག་རྟེན་ན་འདོད་པའི་ཡོན་ཏན་ལྔས་ངོམས་ཤིང་ཆོག་ཤེས་ཏེ་འཆི་བར་འགྱུར་བའི་མི་གང་དག་ཡིན་པ་དེ་དག་ནི་ཉུང་ལ། མིའི་འཇིག་རྟེན་ན་འདོད་པའི་ཡོན་ཏན་ལྔས་མི་ངོམས་ཤིང་ཆོག་མི་ཤེས་ཏེ་འཆི་བར་འགྱུར་བ་ནི་ཆེས་མང་བར་རིག་པར་བྱའོ།
en: “Great King, thus, in this way, you should know that few people die contented and satisfied with the objects of the five kinds of desires in the human world and that many people die discontented and unsatisfied with the objects of the five kinds of desires in the human world.

source: །དེ་ནས་རྒྱལ་པོ་ང་ལས་ནུས་གཏན་པ་མེད་པའི་མཆོད་སྦྱིན་བཏང་ནས་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: “Thereupon King Māndhātṛ made a limitless offering and spoke some more verses:

source: །འཇིག་རྟེན་ཕ་རོལ་ཡ་ང་ཞིང་། །ཚེ་ཐུང་བར་ནི་ཤེས་བྱས་ནས།
en: “ ‘Knowing that life is short, Both in this world and the next,

source: །བསོད་ནམས་དག་ནི་བྱ་བ་སྟེ།
en: One should make merit;

source: །དེ་བས་བསོད་ནམས་འདོད་པ་ཡིས།
en: “ ‘Therefore, if those who wish for merit

source: །སྦྱིན་པ་ཚུལ་བཞིན་བཏང་བྱས་ན།
en: Duly give donations,

source: །འཇིག་རྟེན་འདི་དང་ཕ་རོལ་དུ།
en: They will be pleased in this world and the next,

source: །སྦྱིན་པ་བྱས་པ་དགའ་བར་འགྱུར།
en: Having given such donations.’

source: །ཇི་ཙམ་ན་གྲོང་མི་དང་ཡུལ་མི་རྣམས་ཀྱིས་རྒྱལ་པོ་ང་ལས་ནུ་ན་སྟེ་ཤི་ལ་ཐུག་ཅིང་འདུག་གོ་ཞེས་ཐོས་སོ།
en: “At that time citizens and provincial dwellers heard that King Māndhātṛ had become sick and was dying.

source: །ཐོས་ནས་ཀྱང་ཡང་སྲོག་ཆགས་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དག་རྒྱལ་པོ་ང་ལས་ནུ་བལྟ་བའི་ཕྱིར་ཉེ་བར་སོང་བ་དང་། རྒྱལ་པོས་སྐྱེ་བོའི་ཚོགས་རྣམས་ལ་འདོད་པ་རྣམས་ཀྱི་ཉེས་དམིགས་ཀྱི་གཏམ་ཡང་བྱས་ཁྱིམ་ན་གནས་པའི་ཉེས་དམིགས་དང་། དེ་བཞིན་དུ་འདོད་པ་སྨད་པ་ཡང་བཤད་དེ།
en: After they had heard this, hundreds of thousands of people went to see King Māndhātṛ. The king told the people about the faults of desire and also talked about the faults of living at home and about rejecting desire.

source: དེ་ཐོས་ནས་སྲོག་ཆགས་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དག་ཁྱིམ་གྱི་གནས་སྤངས་ནས་དྲང་སྲོང་རྣམས་ཀྱི་ནང་དུ་རབ་ཏུ་བྱུང་སྟེ།
en: After they had heard this, hundreds of thousands of people abandoned their lives at home and went forth among ṛṣis.

source: ནགས་ཚལ་དུ་འདུག་ནས་ཚངས་པའི་གནས་པ་བཞི་བསྒོམས་པས་འདོད་པ་རྣམས་ལ་འདུན་པ་སྤངས་ཏེ།
en: Having sat in the forest and practiced the four pure ways of abiding, they drove away their longing for objects of desire.

source: དེ་ལ་མང་དུ་གནས་པས་ཚངས་པའི་འཇིག་རྟེན་དུ་སྐལ་བ་མཉམ་པར་སྐྱེས་སོ།
en: Having practiced in this way many times, they were reborn as inhabitants of the world of Brahmā.

source: །རྒྱལ་པོ་ཆེན་པོ་རྒྱལ་པོ་ང་ལས་ནུས་ཇི་སྲིད་གཞོན་ནུ་རྩེ་བའི་ས་ན་རྩེས་པ་དང་། ཇི་སྲིད་རྒྱལ་ཚབ་བྱས་པ་དང་། ཇི་སྲིད་འཛམ་བུའི་གླིང་དུ་རྒྱལ་སྲིད་ཆེན་པོ་བྱས་པ་དང་། ཇི་སྲིད་ཤར་གྱི་ལུས་འཕགས་དང་། ནུབ་ཀྱི་བ་ལང་སྤྱོད་དང་། བྱང་གི་སྒྲ་མི་སྙན་དང་། གསེར་གྱི་རི་བོ་བདུན་ལ་གནས་པ་དང་། ཇི་སྲིད་སུམ་བཅུ་རྩ་གསུམ་གྱི་ལྷ་རྣམས་ཀྱི་གནས་སུ་སོང་སྟེ་གནས་པ་དེའི་བར་ལ་བརྒྱ་བྱིན་བརྒྱད་བཅུ་རྩ་བཞི་ཤི་འཕོས་པ་ལོན་ནོ།
en: “Great King, while King Māndhātṛ was playing as a child, acting as the crown prince, ruling over the great kingdom in the continent of Jambu, living in the continents of Videha in the east, Godānīya in the west, Kuru in the north, and on the seven golden mountains, and going to the residence of the Thirty-Three Gods and living there, one hundred fourteen successive Śakras died.

source: །རྒྱལ་པོ་ཆེན་པོ་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གྱི་ཚེའི་ཚད་ནི་མི་རྣམས་ཀྱི་ལོ་བརྒྱ་གང་ཡིན་པ་དེ་ནི་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱི་ཉིན་ཞག་གཅིག་ཡིན་ནོ།
en: “Great King, how long is the life of Śakra, Lord of the Gods? What is a hundred years for humans is one day for the Thirty-Three Gods.
